Autodesk.Revit.DB.DialogOptions.NewDraftingViewDialogOptions.ValidateAndSave
validateAndSave
Since:
2027

Autodesk.Revit.DB.DialogOptions.NewDraftingViewDialogOptions.GetViewScaleStrings
getViewScaleStrings
Since:
2027

Autodesk.Revit.DB.DialogOptions.NewDraftingViewDialogOptions.GetViewScales
getViewScales
Since:
2027

Autodesk.Revit.DB.DialogOptions.NewDraftingViewDialogOptions.Scale
scale
Since:
2027

Autodesk.Revit.DB.DialogOptions.NewDraftingViewDialogOptions.Title
title
Since:
2027

Autodesk.Revit.DB.DialogOptions.NewDraftingViewDialogOptions.ViewScaleIndex
viewScaleIndex
Since:
2027

Autodesk.Revit.DB.DialogOptions.NewDraftingViewDialogOptions.Name
name
Since:
2027

Autodesk.Revit.DB.DialogOptions.NewDraftingViewDialogOptions.#ctor(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.View,System.String,System.UInt32,System.String)
constructor
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.DialogOptions.NewDraftingViewDialogOptions
The specific class for New Drafting View dialog options as the input for ModalDialogCallEventArgs.
Since:
2027